Конфигурация/InformationRegisters/УсловияСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделок/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекРегистратор = "";
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// автоматическое дозаполнение полей
		Если Не ЗначениеЗаполнено(Запись.СчетДоверительногоУправления) Тогда
			Запись.СчетДоверительногоУправления = Запись.Сделка.СчетДоверительногоУправления;
		КонецЕсли;
				
		// проверка соответствия дат исполнения, оплаты и поставки
		ТекстСообщения = "";
						
		Если Не Запись.ОтложенноеИсполнение И Не (НачалоДня(Запись.Период) = Запись.ДатаИсполнения 			
			И Запись.ДатаИсполнения = Запись.ДатаОплаты И Запись.ДатаИсполнения = Запись.ДатаПоставки) Тогда
			ТекстСообщения = "При исполнении в момент сделки даты оплаты, поставки и исполнения должны совпадать с датой сделки!";
		КонецЕсли;	
		
		Если Запись.ОтложенноеИсполнение И Не Запись.РаздельноеИсполнение И Не (Запись.ДатаИсполнения <> '00010101'
			И Запись.ДатаОплаты = Запись.ДатаИсполнения И Запись.ДатаОплаты = Запись.ДатаИсполнения) Тогда
			ТекстСообщения = "При отложенном исполнении сделки дата исполнения, дата оплаты и дата поставки должны совпадать!";
		КонецЕсли;
		
		Если Запись.РаздельноеИсполнение И Не Запись.ОтложенноеИсполнение Тогда
			ТекстСообщения = "При установленном флажке 'Раздельное исполнение' также должен быть установлен флажок 'Отложенное исполнение'!";
		КонецЕсли;
		
		Справочники.ДепозитарныеСчета.КонтрольВладельцаСчетаДепо(Запись.ДепозитарныйСчет, Запись.Организация, Отказ); 
		
		//Если Запись.ОтложенноеИсполнение И Запись.РаздельноеИсполнение И Не (Запись.ДатаИсполнения = '00010101'
		//	И Запись.ДатаОплаты >= НачалоДня(Запись.Период) И Запись.ДатаПоставки >= НачалоДня(Запись.Период)) Тогда
		//	ТекстСообщения = "При раздельном исполнении сделки дата исполнения должна быть пустой, а даты оплаты и поставки - не ранее даты сделки!";
		//КонецЕсли;
		
		Если ТекстСообщения <> "" И ТекРегистратор <> Запись.Регистратор Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения + ?(Запись.Регистратор = Неопределено, "", " Документ " + СокрЛП(Запись.Регистратор)), Запись.Регистратор,,, Отказ);
			ТекРегистратор = Запись.Регистратор;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	// блокирующие проверки
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
КонецПроцедуры
